Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.7.81/edc/ATSAMD10D13AM.PIC
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="FLOW" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnn-nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFB" edc:_addr="0x41006008">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MTB">
            <edc:SFRFieldDef edc:cname="AUTOSTOP" edc:nzwidth="0x1" edc:desc="Auto Stop Tracing"/>
            <edc:SFRFieldDef edc:cname="AUTOHALT" edc:nzwidth="0x1" edc:desc="Auto Halt Request"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WATERMARK" edc:nzwidth="0x1D" edc:desc="Watermark value"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="BASE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x4100600C"/>
      <edc:AdjustPoint edc:offset="0xEF0" edc:_addr="0x41006010"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="ITCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006F00"/>
      <edc:AdjustPoint edc:offset="0x9C" edc:_addr="0x41006F04"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CLAIMSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006FA0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CLAIMCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006FA4"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41006FA8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="LOCKACCESS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:_addr="0x41006FB0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="LOCKSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FB4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FB8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVARCH" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FBC"/>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0x41006FC0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVID" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FC8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="DEVTYPE" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FCC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID4" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FD0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID5" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FD4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID6" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FD8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID7" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FDC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FE0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FE4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FE8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="PID3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FEC"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID0" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FF0"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID1" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FF4"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID2" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FF8"/>
      <edc:SFRDef ltx:memberofperipheral="MTB" edc:cname="CID3" edc:nzwidth="0x20" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:_addr="0x41006FFC"/>
      <edc:AdjustPoint edc:offset="0x80" edc:_addr="0x41007000"/>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS0PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007080">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS0PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007084">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS1PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007088">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS1PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100708C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS2PRAS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007090">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M0PR" edc:nzwidth="0x4" edc:desc="Master 0 Priority"/>
            <edc:SFRFieldDef edc:cname="M1PR" edc:nzwidth="0x4" edc:desc="Master 1 Priority"/>
            <edc:SFRFieldDef edc:cname="M2PR" edc:nzwidth="0x4" edc:desc="Master 2 Priority"/>
            <edc:SFRFieldDef edc:cname="M3PR" edc:nzwidth="0x4" edc:desc="Master 3 Priority"/>
            <edc:SFRFieldDef edc:cname="M4PR" edc:nzwidth="0x4" edc:desc="Master 4 Priority"/>
            <edc:SFRFieldDef edc:cname="M5PR" edc:nzwidth="0x4" edc:desc="Master 5 Priority"/>
            <edc:SFRFieldDef edc:cname="M6PR" edc:nzwidth="0x4" edc:desc="Master 6 Priority"/>
            <edc:SFRFieldDef edc:cname="M7PR" edc:nzwidth="0x4" edc:desc="Master 7 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="PRS2PRBS" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007094">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="M8PR" edc:nzwidth="0x4" edc:desc="Master 8 Priority"/>
            <edc:SFRFieldDef edc:cname="M9PR" edc:nzwidth="0x4" edc:desc="Master 9 Priority"/>
            <edc:SFRFieldDef edc:cname="M10PR" edc:nzwidth="0x4" edc:desc="Master 10 Priority"/>
            <edc:SFRFieldDef edc:cname="M11PR" edc:nzwidth="0x4" edc:desc="Master 11 Priority"/>
            <edc:SFRFieldDef edc:cname="M12PR" edc:nzwidth="0x4" edc:desc="Master 12 Priority"/>
            <edc:SFRFieldDef edc:cname="M13PR" edc:nzwidth="0x4" edc:desc="Master 13 Priority"/>
            <edc:SFRFieldDef edc:cname="M14PR" edc:nzwidth="0x4" edc:desc="Master 14 Priority"/>
            <edc:SFRFieldDef edc:cname="M15PR" edc:nzwidth="0x4" edc:desc="Master 15 Priority"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
