Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMD10_DFP/2.7.81/edc/ATSAMD10D13AM.PIC
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR7" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100712C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR8" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007130">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR9" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007134">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR10" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007138">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR11" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100713C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR12" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007140">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR13" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007144">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR14" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x41007148">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="SBMATRIX" edc:cname="SFR15" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4100714C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SBMATRIX">
            <edc:SFRFieldDef edc:cname="SFR" edc:nzwidth="0x20" edc:desc="Special Function Register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0xFF8EB0" edc:_addr="0x41007150"/>
      <edc:SFRDef ltx:memberofperipheral="PAC2" edc:cname="WPCLR" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFE" edc:_addr="0x42000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC2">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WP" edc:nzwidth="0x1F" edc:desc="Write Protection Clear"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC2" edc:cname="WPSET" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn-" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xFFFFFFFE" edc:_addr="0x42000004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC2">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WP" edc:nzwidth="0x1F" edc:desc="Write Protection Set"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3F8" edc:_addr="0x42000008"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CTRL" edc:nzwidth="0x8" edc:access="---w---w" edc:por="00000000" edc:mclr="00000000" edc:impl="0x11" edc:_addr="0x42000400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="GCLKREQ" edc:nzwidth="0x1" edc:desc="Generic Clock Requests"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x3" edc:_addr="0x42000401"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHANNEL" edc:nzwidth="0x20" edc:access="----nnnn--nnnnnn-------n-----nnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0xF3F0107" edc:_addr="0x42000404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x3" edc:desc="Channel Selection"/>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SWEVT" edc:nzwidth="0x1" edc:desc="Software Event"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="EVGEN" edc:nzwidth="0x6" edc:desc="Event Generator Selection"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PATH" edc:nzwidth="0x2" edc:desc="Path Selection">
              <edc:SFRFieldSemantic edc:cname="SYNCHRONOUS" edc:desc="Synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RESYNCHRONIZED" edc:desc="Resynchronized path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="ASYNCHRONOUS" edc:desc="Asynchronous path" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EDGSEL" edc:nzwidth="0x2" edc:desc="Edge Detection Selection">
              <edc:SFRFieldSemantic edc:cname="NO_EVT_OUTPUT" edc:desc="No event output when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="RISING_EDGE" edc:desc="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FALLING_EDGE" edc:desc="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="BOTH_EDGES" edc:desc="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="USER" edc:nzwidth="0x10" edc:access="----nnnn---nnnnn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0xF1F" edc:_addr="0x42000408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USER" edc:nzwidth="0x5" edc:desc="User Multiplexer Selection"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CHANNEL" edc:nzwidth="0x4" edc:desc="Channel Event Selection">
              <edc:SFRFieldSemantic edc:cname="0" edc:desc="No Channel Output Selected" edc:when="(field &amp; 0xF) == 0"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x2" edc:_addr="0x4200040A"/>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="CHSTATUS" edc:nzwidth="0x20" edc:access="------------------rrrrrr--rrrrrr" edc:por="00000000000000000000000000111111" edc:mclr="00000000000000000000000000111111" edc:impl="0x3F3F" edc:_addr="0x4200040C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="USRRDY0" edc:nzwidth="0x1" edc:desc="Channel 0 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY1" edc:nzwidth="0x1" edc:desc="Channel 1 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY2" edc:nzwidth="0x1" edc:desc="Channel 2 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY3" edc:nzwidth="0x1" edc:desc="Channel 3 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY4" edc:nzwidth="0x1" edc:desc="Channel 4 User Ready"/>
            <edc:SFRFieldDef edc:cname="USRRDY5" edc:nzwidth="0x1" edc:desc="Channel 5 User Ready"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="CHBUSY0" edc:nzwidth="0x1" edc:desc="Channel 0 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY1" edc:nzwidth="0x1" edc:desc="Channel 1 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY2" edc:nzwidth="0x1" edc:desc="Channel 2 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY3" edc:nzwidth="0x1" edc:desc="Channel 3 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY4" edc:nzwidth="0x1" edc:desc="Channel 4 Busy"/>
            <edc:SFRFieldDef edc:cname="CHBUSY5" edc:nzwidth="0x1" edc:desc="Channel 5 Busy"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENCLR" edc:nzwidth="0x20" edc:access="------------------nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F" edc:_addr="0x42000410">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTENSET" edc:nzwidth="0x20" edc:access="------------------nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F" edc:_addr="0x42000414">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="EVSYS" edc:cname="INTFLAG" edc:nzwidth="0x20" edc:access="------------------nnnnnn--nnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3F3F" edc:_addr="0x42000418">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
            <edc:SFRFieldDef edc:cname="OVR0" edc:nzwidth="0x1" edc:desc="Channel 0 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR1" edc:nzwidth="0x1" edc:desc="Channel 1 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR2" edc:nzwidth="0x1" edc:desc="Channel 2 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR3" edc:nzwidth="0x1" edc:desc="Channel 3 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR4" edc:nzwidth="0x1" edc:desc="Channel 4 Overrun"/>
            <edc:SFRFieldDef edc:cname="OVR5" edc:nzwidth="0x1" edc:desc="Channel 5 Overrun"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="EVD0" edc:nzwidth="0x1" edc:desc="Channel 0 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD1" edc:nzwidth="0x1" edc:desc="Channel 1 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD2" edc:nzwidth="0x1" edc:desc="Channel 2 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD3" edc:nzwidth="0x1" edc:desc="Channel 3 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD4" edc:nzwidth="0x1" edc:desc="Channel 4 Event Detection"/>
            <edc:SFRFieldDef edc:cname="EVD5" edc:nzwidth="0x1" edc:desc="Channel 5 Event Detection"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
